Revit 2027 API
IFCFamilyInstanceExtrusionExportResults.ExtraOffset Property
 The extra offset determined from the geometry of the family instance.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ExtraOffset { get; }
Public ReadOnly Property ExtraOffset As XYZ
	Get
public:
property XYZ^ ExtraOffset {
	XYZ^ get ();
}
member ExtraOffset : XYZ with get
Property Value
XYZ
See Also
Reference
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace